{
  "name": "Join to Free Code Camp",
  "order": 1,
  "time": "15 miniutes",
  "helpRoom": "Help",
  "challenges": [
    {
      "id": "560add10cb82ac38a17513be",
      "title": "Learn how Free Code Camp Works",
      "description": [
        [
          "//i.imgur.com/6ibIavQ.jpg",
          "A picture of Free Code Camp's 4 benefits: Get connected, Learn JavaScript, Build your Portfolio, Help nonprofits",
          "欢迎来到Free Code Camp，我们是帮助你学习编程的开源社区。",
          ""
        ],
        [
          "//i.imgur.com/Elb3dfj.jpg",
          "A screenshot of some of our campers coding together in Toronto.",
          "学习编码是很难的。要想取得成功，就需要大量的实践和支持。这就是为什么我们创建了一个严格的课程和支持团体。",
          ""
        ],
        [
          "//i.imgur.com/D7Y5luw.jpg",
          "A graph of the rate of job growth against growth in computer science degree graduates. There are 1.4 million jobs and only 400 thousand people to fill them.",
          "每年都有成千上万的编码工作空缺着，对程序员的需求每年持续增长。",
          ""
        ],
        [
          "//i.imgur.com/WD3STY6.jpg",
          "Photos of three campers who've gotten jobs after learning to code at Free Code Camp.",
          "Free Code Camp是开启你的程序员生涯的有效途径。事实上，没有人完成了整个课程，因为营员在毕业前一般都能找到工作。",
          ""
        ],
        [
          "//i.imgur.com/vLNso6h.jpg",
          "An illustration showing that you will learn HTML5, CSS3, JavaScript, Databases, Git, Node.js, React and D3.",
          "我们会通过几百个编码挑战来让你逐渐掌握这些Web开发技术。",
          ""
        ],
        [
          "//i.imgur.com/UVB9hxp.jpg",
          "An image of a camper at a cafe building projects on Free Code Camp.",
          "我们相信人类学习的最好方式就是实践，你会花费大量的时间来做项目。",
          ""
        ],
        [
          "//i.imgur.com/pbW7K5S.jpg",
          "An image of showing our front end, back end, and data visualization certifications (400 hours each), our nonprofit projects (800 hours), and interview prep (80 hours) for a total of 2,080 hours of coding experience.",
          "全部通过我们的课程挑战可以获得四个证书，这些证书非常受到企业雇主的认可。前三个证书每个大约花费400个小时，最后一个证书将花费800个小时，我们推荐你按照顺序完成他们，但是你也可以自己跳跃。",
          ""
        ],
        [
          "//i.imgur.com/k8btNUB.jpg",
          "A screenshot of our Front End Development Certificate",
          "如果你用HTML+CSS+jQuery+JavaScript完成了10个项目，你就可以获得我们的前端开发证书。",
          ""
        ],
        [
          "//i.imgur.com/Et3iD74.jpg",
          "A screenshot of our Data Visualization Certificate",
          "如果你用React+Sass+D3.js完成了10个项目，你就可以获得我们的数据可视化证书。",
          ""
        ],
        [
          "//i.imgur.com/8v3t84p.jpg",
          "A screenshot of our Back End Development Certificate",
          "如果你用Node.js,+Express+MongoDB完成了10个项目，你就可以获得我们的后端开发证书，你还可以通过Git和Heroku把项目部署到云上，让所有人都可以访问。",
          ""
        ],
        [
          "//i.imgur.com/yXyxbDd.jpg",
          "A screen shot of our nonprofit project directory.",
          "当你完成了获得了前面三个证书后，你就可以和你的营员一起组队运用敏捷软件开发技术构建两个真实项目，同时你被要求给两个陈旧的项目添加功能。当你完成这些后，你就拥有了一个作品集，里面包含人们每天都在使用作品。",
          ""
        ],
        [
          "//i.imgur.com/PDGQ9ZM.jpg",
          "An image of campers building projects together in a cafe in Seoul.",
          "如果你完成了2080个小时的挑战和项目，你会获得我们的全栈开发证书。我们给你提供了免费的代码面试练习和工作机会信息，满足你面试和找工作的需求。",
          ""
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7
    },
    {
      "id": "560add37cb82ac38a17513bf",
      "title": "Create a GitHub Account and Join our Chat Rooms",
      "description": [
        [
          "//i.imgur.com/EAR7Lvh.jpg",
          "A screenshot of our one of our Gitter chat rooms.",
          "在我们开始编码前，让我们先加入FreeCodeCamp聊天室，你可以在这里闲逛、提问或者寻找营友一起结对编程，当然首先你得有一个GitHub账户。",
          ""
        ],
        [
          "//i.imgur.com/n6GeSEm.gif",
          "A gif showing you to click the link below to go to GitHub. Fill in the necessary fields and click submit. Then check your email inbox for an email from GitHub so you can verify your account.",
          "点击下面的在新标签栏打开按钮可以打开GitHub网站，通过填写下面的表格可以创建一个GitHub账户。确保你的邮箱是真实的，然后点击检查你的邮箱。打开你的邮箱后，找到最新的邮件，点击验证邮箱地址即可。 <br><div class=\"small\">提示：如果你已经有GitHub账户，你可以把新打开的页面关闭掉，然后点击前进。我们移除了跳过按钮，因为很多人仅仅是重复点击，而没有做这些重要的步骤。</div>",
          "https://github.com/join"
        ],
        [
          "//i.imgur.com/hFqAEr8.gif",
          "A gif showing you how to click the profile image in the upper right hand corner of GitHub. Upload a photo of yourself or you will continue to use the automatically generated pixel art. Then fill in the remaining form fields and click submit.",
          "Click the pixel art in the upper right hand corner of GitHub, then choose settings. Upload a picture of yourself. A picture of your face works best. This is how your fellow campers will see you in our chat rooms, so look your best. You can add your city and your name if you want.",
          "https://github.com/settings/profile"
        ],
        [
          "//i.imgur.com/pYk0wOk.gif",
          "A gif showing how you can star a GitHub repo.",
          "Open Free Code Camp's open-source repository. This is where our volunteer team collaborates on building Free Code Camp. You can \"star\" our repository. \"Starring\" is the GitHub equivalent of \"liking\" something.",
          "https://github.com/freecodecamp/freecodecamp"
        ],
        [
          "//i.imgur.com/OmRmLB4.gif",
          "A gif showing you how to click the link below to go to our chat room and click the \"sign in with GitHub\" button. Then you can click into the text input field and type a message to your fellow campers.",
          "Now that you have a GitHub account, you can join our main chat room by logging in with GitHub. Introduce yourself by saying \"Hello world!\" Tell your fellow campers how you found Free Code Camp. Also tell us why you want to learn to code.",
          "https://gitter.im/FreeCodeCamp/FreeCodeCamp"
        ],
        [
          "//i.imgur.com/Ecs5XAd.gif",
          "A gif showing you how you can click the settings button in the upper right hand corner and modify your notification settings.",
          "Our chat rooms are extremely active. You should change your settings so you're only notified if someone mentions you.",
          ""
        ],
        [
          "//i.imgur.com/T0bGJPe.gif",
          "A gif showing how you can click on a user profile image to initiate a private message with that user.",
          "Please note that all of our chat rooms are visible to the public. If you need to share sensitive information, such as an email address or phone number, do it in a private message.",
          ""
        ],
        [
          "//i.imgur.com/vDTMJSh.gif",
          "A gif showing that you can tab back and forth between challenges and our chat rooms.",
          "Keep our chat room open while you work through our challenges. That way, you can ask for help if you get stuck. You can also socialize with other campers when you feel like taking a break.",
          ""
        ],
        [
          "//i.imgur.com/WvQvNGN.gif",
          "A gif showing how you can click the link below to download a native chat room app for your computer.",
          "You can also download the chat room app to your computer or phone.",
          "https://gitter.im/apps"
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7
    },
    {
      "id": "560add56cb82ac38a17513c0",
      "title": "Configure your Code Portfolio",
      "description": [
        [
          "//i.imgur.com/tP2ccTE.gif",
          "A gif showing how you can click your profile image in your upper right hand corner to your code portfolio and connect GitHub.",
          "Check out your code portfolio. Click your picture in your upper right hand corner. To activate your code portfolio, you'll need to link your GitHub account with Free Code Camp. Your code portfolio shows your progress and how many Brownie Points you have. You can get Brownie Points by completing challenges and by helping other campers in our chat rooms. If you get Brownie Points on several days in a row, you'll get a streak.",
          ""
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7
    },
    {
      "id": "560add71cb82ac38a17513c2",
      "title": "Join a Campsite in Your City",
      "description": [
        [
          "//i.imgur.com/XugIMb4.jpg",
          "A picture of some of our campers meeting in a local cafe.",
          "Our Campsites are Facebook groups that help you meet other campers in your city. You can use these groups to plan and attend casual \"coffee-and-code\" events, where you meet other campers at a café and code together.",
          ""
        ],
        [
          "//i.imgur.com/fTFMjwf.gif",
          "A gif showing how you can click the link below, find your city on the list of Campsites, then click on the Facebook link for your city and join your city's Facebook group.",
          "Find your city on this list and click it. This will take you to your city's Campsite's Facebook group. Click the \"Join group\" button to apply to join your city's Facebook group. Someone from the campsite should approve you shortly. If your city isn't on this list, scroll to the bottom of the wiki article for instructions for how you can create your city's Campsite.",
          "https://github.com/FreeCodeCamp/freecodecamp/wiki/List-of-Free-Code-Camp-city-based-Campsites"
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7
    },
    {
      "id": "560add8ccb82ac38a17513c4",
      "title": "Learn What to Do If You Get Stuck",
      "description": [
        [
          "//i.imgur.com/lzKvwU2.jpg",
          "The text \"Coding is hard.\"",
          "Coding is hard. You will get stuck. Even experienced coders get stuck. The key is knowing how to get unstuck.",
          ""
        ],
        [
          "//i.imgur.com/sfsidp6.jpg",
          "The text \"It takes time to get good at coding.\"",
          "It takes time to get good at coding. You wouldn't expect to beat a chess master after playing for 3 months. Don't expect to build the next Facebook after coding for 3 months.",
          ""
        ],
        [
          "//i.imgur.com/EoTfOyC.jpg",
          "An image of some of our campers coding together in Montreal.",
          "Keep practicing coding every day and hanging out with other people who code, and you will become a job-ready coder.",
          ""
        ],
        [
          "//i.imgur.com/EWWZBag.jpg",
          "An image with the text \"1. Read the error 2. Search Google 3. Ask for help.",
          "Any time you get stuck or don't know what to do next: Read-Search-Ask.",
          ""
        ],
        [
          "//i.imgur.com/99BfAcK.jpg",
          "An image showing jQuery documentation",
          "First, read the documentation or error message. A key skill that good coders have is the ability to interpret and then follow instructions.",
          ""
        ],
        [
          "//i.imgur.com/GxvrsFb.gif",
          "A gif showing you how to do an advanced Google search. First, we enter the query \"jquery doesn't run when my page loads\". Then we click search tools button and change the \"Any time\" select box to \"within the last year\". Then we click on a result and read through the article and find our answer.",
          "If that didn't help, search Google. Good Google queries take a lot of practice. When you search Google, you usually want to include the language or framework you're using. You also want to limit the results to a recent period.",
          ""
        ],
        [
          "//i.imgur.com/LZYU7p2.gif",
          "A gif showing us following the link below to go to the help chat room and ask \"jquery doesn't run when my page loads\".",
          "If that didn't help, ask your friends. If you have trouble, you can ask your fellow campers in our help chat room.",
          "https://gitter.im/FreeCodeCamp/Help"
        ],
        [
          "//i.imgur.com/ZRgXraT.gif",
          "A gif showing us scrolling through our challenge map.",
          "Now you're ready to start coding. The \"Map\" button in your upper right hand corner will show you our challenge map. We recommend that you complete these from top to bottom, at a sustainable pace. Our open source community is constantly improving our challenges, so don't be surprised if they change or move around. Don't worry about going back - just keep moving forward. You can always go to your most recent challenge by clicking the \"Learn\" button.",
          ""
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7
    }
  ]
}
